In [4]:
import pandas as pd
import numpy as np

In [10]:
empdata= {
    'Name':['Raj','Rajesh'],
    'Sal':[1000,2000],
    'Age':[20,21]
}

In [20]:
emp_df = pd.DataFrame(empdata)

In [21]:
emp_df

         0     1     2     3     4
0      Raj  1000  23.0  45.0  65.0
1   Rajesh  2000   NaN   NaN   NaN
2  Shristi  3000   NaN   NaN   NaN
3   Poonam  4000   NaN   NaN   NaN

In [1]:
# Creating dataframe from a list of tuples

In [17]:
empdata = [('Raj',1000,23,45,65),('Rajesh',2000),('Shristi',3000),('Poonam',4000)]

In [25]:
emp_df = pd.DataFrame(empdata)

In [19]:
emp_df

         0     1     2     3     4
0      Raj  1000  23.0  45.0  65.0
1   Rajesh  2000   NaN   NaN   NaN
2  Shristi  3000   NaN   NaN   NaN
3   Poonam  4000   NaN   NaN   NaN

In [2]:
# dataframe operations